import React from 'react';
import { makeStyles } from '@material-ui/core';
import Img from './img.js';

const useStyles = makeStyles({
    root: {
        margin: '0',
        padding: '0',
        '& h3': {
            textAlign: 'center',
            textTransform: 'uppercase'
        },
        '& p': {
            textAlign: 'justify'
        },
    }
});


const Hill = ()=> {
    const classes = useStyles();

    return (
        <div className={classes.root}>
            <h3>Пагорб слави</h3>
            <Img src="./hw3/pagorb.jpg" about="Пагорб Слави у Черкасах"/>
            <p>
                <strong>«Пагорб Сла́ви»</strong> — меморіальний комплекс в Україні в місті Черкаси,
                зведений у пам'ять про загиблих мешканців міста в роки німецько-радянської війни.
                Меморіал увічнює пам'ять черкасців, які загинули на фронтах, та воїнів, полеглих у боях за Черкаси.
                Збудований 1965 року, а 1975 року реконструйований у комплекс.
                Загальна висота земляного пагорба — 10 м, діаметр основи — 60 м.
            </p>
            <p>
                Композиція вирішена у великих монументальних формах.
                Широку ритуальну площу завершує курганоподібний насип із гранітними східцями,
                увінчаний скульптурою жінки-матері Батьківщини висотою 10 м.
                У піднятій правій руці знаходиться чаша з Вічним вогнем, ліва рука звернена вперед,
                до ритуальної площі. На облицьованій гранітом підпірній стіні напівовальної форми
                змонтована горельєфна композиція (розміри 20,9x2,2 м) на батальну тему
                і висічені прізвища 904 воїнів-черкащан, які загинули в роки другої світової війни.
            </p>
            <p>
                На вершину пагорба, де поховано майже тисячу воїнів, ведуть тераси, викладені гранітними блоками.
                Насипну частину пагорба обрамлює меморіальна гранітна стіна з викарбуваними іменами мешканців міста,
                які полягли у боях. На підпірній стіні знаходиться 5 бронзових барельєфів, що розповідають про тяжкі часи війни.
                На першому зображено ополченців 1941 року, на другому — бій з фашистами.
                В центрі барельєфа — постать молодого бійця, який, вражений кулею, падає у пшеницю.
                На третьому барельєфі показана багнетна атака радянських воїнів, на четвертому —
                як у вбитого прапороносця товариш підхоплює прапор.
                На п'ятому — увічнені представники всіх родів військ Радянської Армії.
            </p>
        </div>
    );
}

export default Hill;