import React from 'react';
import { makeStyles } from '@material-ui/core/styles';
import Img from './img.js';

const useStyles = makeStyles({
    root: {
        margin: '0',
        padding: '0',
        '& p': {
            textAlign: 'justify'
        },
        '& .symbols': {
            display: 'grid',
            gridTemplateColumns: '3fr 1fr',
            gap: '1rem'
        }
    }
});

const Home = ()=> {
    const classes = useStyles();

    return (
        <div className={classes.root}>
            <p>
                <strong>Черка́си</strong> — місто, обласний та районний центр в Україні,
                промисловий центр Центрального економічного району,
                значний культурний та освітній осередок.
                Місто відоме з XIII століття і за час свого існування
                відіграло певну роль в історії всієї України.
                Черкаси були осередком формування Козаччини,
                мешканці міста брали безпосередню участь в Хмельниччині та Коліївщині.
                Зростання міста, після отримання статусу обласного центру,
                призвело до перетворення його у великий промисловий центр
                і головний культурний осередок цілого регіону.
            </p>
            <div className="symbols">
                <Img src="./hw3/flag.svg" about="прапор Черкас"/>
                <Img src="./hw3/gerb.svg" about="герб Черкас"/>
            </div>
            <p>
                Адміністративно місто поділяється на 2 міських райони —
                Придніпровський та Соснівський, до останнього також належить селище Оршанець.
                Населення міста — 276 360 осіб (2019).
            </p>
            <p>
                Походження топоніму «Черкаси» та його істинна етимологія лишається нерозв'язаною і дотепер загадкою.
                Назва міста напряму пов'язана з екзоетнонімом черкаси — так називали всіх українців сусідні народи,
                зокрема росіяни та кримські татари, про що вперше повідомив 1245 року
                італійський посол Джованні Да Плано Карпіні.
            </p>
            <h3>Розташування</h3>
            <p>
                Черкаси розташовані на високому правому березі головної річкової артерії України — Дніпра,
                зокрема, створеного в його середній течії Кременчуцького водосховища,
                через яке збудовано чи не найбільший міст-дамбу в Україні.
                Рельєф історичної частини міста сформували Замкова гора, на якій розташовувався Черкаський замок,
                та численні яри в Соснівці. Але більша частина міста розташована на рівнині.
                Інтенсивна урбанізація спотворила історичний природний ландшафт дніпровських пагорбів у Черкасах.
                Особливо руйнівними виявилися дії радянських містобудівників.
            </p>
            <h3>Клімат</h3>
            <p>
                Клімат Черкас обумовлений розташуванням на березі Кременчуцького водосховища.
                Загалом клімат міста є помірно континентальним з м'якою зимою і теплим літом.
                На особливості мікроклімату впливає розташування Черкас поблизу великої водойми.
            </p>                                                
            <p>
                Середньорічна температура повітря в місті становить +7,7 °C, мінімальна вона у січні (-5,9 °C),
                максимальна — у липні (+19,8 °C). Найнижча пересічна температура повітря в січні (-16,6 °C)
                зафіксована в 1963 році, найвища (+1,6 °C) — в 2007.
                Такі ж піки для липня становлять відповідно — найнижчий +17,6 °C (1978 і 1979 роки),
                а найвищий +25,8 °C (1936). Абсолютний мінімум температури повітря в Черкасах було зафіксовано
                в січні 1935 року і він склав −35,3 °C, тоді як абсолютний максимум +37,4 °C — 30 липня 1936 року
                та +38 °C — 7 липня 2012 року.
            </p>
            <h3>Історія</h3>
            <p>
                В історії Черкас досі є багато маловивчених сторінок.
                Значний вплив на сучасне розуміння історичного розвитку міста і краю має той факт,
                що воно переважно формувалось російською, а тому повністю радянською історіографією,
                через що деякі періоди міської історії лишаються невисвітленими, частина документів замовчуються,
                або й дотепер викривляються. І хоча про початки Черкас відомо мало, достеменним є факт існування
                і зростання міста вже в XIV столітті та перетворення його в подальшому на значний осередок Козаччини
                (Черкаси були центром козацьких полків з 1625 по 1687 рік),
                відтак участь громади міста в усіх важливих подіях козацької історії України —
                від Хмельниччини до Коліївщини. На території Черкас в першій половині 1664 року точилися бої козаків
                Правобережного гетьмана Павла Тетері та польських загонів з лівобережними козаками
                під керуванням гетьмана Івана Брюховецького та московськими військами.
                Значення міста як козацького центру було таким важливим,
                що якийсь час іменування черкаси правило етнонімом всіх українців.
                Безперечним також є економічне піднесення і українське культурне життя в Черкасах
                у 2-й половині XIX — на початку ХХ століття. Місто не оминули ані жорстокі соціальні
                експерименти перших десятиліть радянської влади, ні тягар Другої Світової війни.
                За переказами старожилів міста, радянська влада вивезла з територї Черкас та Черкаської області
                багато коштовностей козацької доби, що мають як велику матеріальну, так і історичну цінність.
                Вирішальним же для відбудови й подальшого розвитку Черкас стало те,
                що від 1954 року місто стало адміністративним центром «наймолодшої» області держави.
            </p>                                                
        </div>
    );
}

export default Home;