import React from 'react';
import { makeStyles } from '@material-ui/core';
import Img from './img.js';

const useStyles = makeStyles({
    root: {
        margin: '0',
        padding: '0',
        '& h3': {
            textAlign: 'center',
            textTransform: 'uppercase'
        },
        '& p': {
            textAlign: 'justify'
        },
    }
});

const Places = ()=> {
    const classes = useStyles();

    return (
        <div className={classes.root}>
            <h3>Долина Троянд</h3>
            <Img src="./hw3/dolyna.jpg" about="Долина троянд у Черкасах"/>
            <p>
                <strong>Доли́на Троя́нд</strong> — парк-пам'ятка садово-паркового мистецтва в Україні
                розміщений неподалік від центральної частини міста Черкаси, при вулиці Гагаріна,
                на березі Кременчуцького водосховища, від якого відгороджений лісосмугою.
                Поруч з парком розміщений меморіальний комплекс Пагорб Слави.
            </p>
            <p>
                Площа 4,3 га. Перебуває у віданні КП «Дирекція парків» (Черкаська міська рада).
            </p>
            <p>
                У парку є декілька фонтанів з міні-озерами, облаштовані алеї з лавочками та ліхтарями,
                а також невеликий пляж на березі Дніпра. У 2012 році в парку збудований сонячний годинник
                у вигляді журавля та дванадцяти металевих кованих стільців.
                «Долина Троянд» традиційно використовується для святкування дня міста.
                Тут у липні 2019 року відбувся уже ХІ етнічний фестиваль «Трипільські зорі».
                На основній сцені цього фестивалю виступали такі музичні гурти як «Євшан зілля»,
                «Сонце в кишені», «Астарта і Діля», «The ВЙО» та інші.
                На п'ятому — увічнені представники всіх родів військ Радянської Армії.
            </p>
            <h3>Черка́ський обласни́й краєзна́вчий музе́й</h3>
            <Img src="./hw3/museum.jpg" about="Черка́ський обласни́й краєзна́вчий музе́й"/>
            <p>
                <strong>Черка́ський обласни́й краєзна́вчий музе́й</strong> — найбільше зібрання матеріалів і документів з історії,
                етнографії й культури Черкащини, її уродженців і персоналій. Музей розташований в історичній частині міста
                за адресою: вул. Слави, буд. 1, м. Черкаси-18000, Україна. Заклад є одним із найбільших
                з-поміж подібних у державі. Щороку музей відвідує до 150 тисяч осіб;
                значна їх частина — діти та молодь. Черкаський краєзнавчий музей постійно відкриває десятки нових виставок,
                що дає змогу ширше знайомити відвідувачів із музейними фондовими колекціями й популяризувати їх.
                Завдяки розробленій та впровадженій в життя системі музейної роботи з молодим поколінням
                популярність музею зростає.
            </p>
            <p>
                Черкаський краєзнавчий музей був заснований у травні 1918 року за ініціативою місцевого осередку товариства «Просвіта»
                і вчительської громадськості міста як історико-педагогічний музей ім. Т. Г. Шевченка.
                Керівником ініціативної групи й першим директором музею став дослідник історії краю Дмитро Панасович Бочков.
            </p>
            <p>
                Експозиція музею розміщена в 30 залах на площі 2800 м².
                Вона має розділи: природи краю, археології, етнографії, історії краю XIV — початку XX століття,
                історії краю від 1917 року і сучасність та велика зала вшанування пам'яті пророка України Т. Г. Шевченка,
                низка окремих зал, присвячених видатним землякам, вихідцям з Черкащини або відомим особам,
                чия діяльність пов'язана з «Шевченковим краєм» (поет Василь Симоненко,
                ботанік і селекціонер Володимир Симиренко, політик В'ячеслав Чорновіл.
            </p>
            <p>
                Експозиція музею представляє широкий діапазон тематичних розділів, де гармонійно розподілені
                в історичній періодизації близько 12 тисяч експонатів. Фондова ж колекція музею станом на початок 2003 року
                становила понад 106 тисяч одиниць збереження основного та науково-допоміжного фондів.
                Раритетами музею є колекція стародруків, ікон, етнографічна та археологічна колекції,
                оологічна колекція О. В. Носаченка. Музей володіє унікальною колекцією Шевченківських видань,
                яка налічує понад 330 музейних предметів, — це прижиттєві та посмертні видання творів Т. Г. Шевченка,
                переклади на мови народів світу, видані в різний час, в різних державах.
            </p>
            <p>
                Серед унікальних експонатів чільне місце посідає колекція речей козацької доби.
                Це, перш за все, козацька зброя: пістолі, гармати різного калібру і розміру, порохівниці.
                В експозиції можна побачити абардажні піки, бойові сокири, рушниці, козацькі люльки.
                Та гордістю музею є двері від козацького куреня І-ї половини XVIII ст. із зображеною на них
                народною картиною «Козак Мамай».
            </p>
            <h3>Черкаський міський зоопарк</h3>
            <Img src="./hw3/zoo.jfif" about="Черкаський міський зоопарк"/>
            <p>
                <strong>Черка́ський зоопа́рк</strong> — міський зоологічний парк загальнодержавного значення в Черкасах.
                Заснований 1 травня 1979 року на базі зоокуточка станції юних натуралістів.
                Тоді його територія становила 3,7 гектарів. До моменту відкриття його колекція налічувала 86 видів тварин.
            </p>
            <p>
                Зараз площа зоопарку складає 4,37 га. Підпорядкований департаменту освіти та гуманітарної політики
                і є природоохоронною, культурно-освітньою та науково-дослідною установою.
                На сьогодні колекція зоопарку нараховує понад 270 видів тварин з різних куточків нашої планети.
            </p>
            <p>
                Спеціалізація Черкаського зоопарку: тварини тераріумної групи та тварини лісової і лісостепової зон фауни України.
                На території зоопарку працюють такі комплекси: «Мадагаскар», «Земля ведмедів і вовків»,
                «Акватераріум», «Папуги», «Експозиція пеліканів» та ін.
            </p>                        
        </div>
    );
}

export default Places;