import React, { useState } from 'react';

export const StoreContext = React.createContext(null);

const infoOfPainter = {
    name: "Оскар-Клод Моне",
    img: "./images/Claude_Monet.jpg",
    notes: [
        {
            id: 0,
            text:`Оскар-Клод Моне (фр. Oscar-Claude Monet; 14 листопада 1840, Париж,
                  Королівство Франція — 5 грудня 1926) — французький живописець.
                  Писав свої картини рядами малих кольорових цяток чистих спектральних кольорів,
                  а не змішував їх на палітрі, як зазвичай роблять художники.
                  Він розраховував на оптичне суміщення кольорових цяток в зоровому сприйнятті.
                  Завдяки цьому прийому Моне прагнув створити враження м'якої вібрації повітря,
                  і це надає його картинам абсолютно оригінальний вигляд.`
        },
        {
            id: 1,
            text:`Клод Моне - художник, з яким пов'язане виникнення імпресіонізму.
                  Назва цієї течії дала одна з його картин - "Враження.
                  Сонце, що сходить" (1872 р.). В юності художник жив в Гаврі, де, за порадою Будена,\
                  писав пейзажі на відкритому повітрі.  У 1859 р., переїхавши до Парижа,
                  Моне подружився з Піссарро і  Ренуаром, які теж воліли писати безпосередньо з натури.
                  Розвиваючи досягнення майстрів барбізонської школи, з 2-ї половини 1860-х р.
                  прагнув передати засобами пленерного живопису мінливість світлоповітряного середовища,
                  всю барвисту картину світу, зберігши свіжість першого зорового її сприйняття.`
        },
        {
            id: 2,
            text:`Першою значною роботою, яка підводить підсумки творчих пошуків цього періоду,
                  став для К. Моне "Сніданок на траві" (1865-1866), написаний ним услід за
                  однойменною програмної роботою Е. Мане. Сама робота до нас не дійшла:
                  художник залишив її в рахунок сплати за житло в селі Шайи,
                  в околицях якої він працював. Але збереглася її зменшена копія,
                  що дозволяє скласти загальне уявлення про картину. Сюжет картини простий:
                  на узліссі розташувалися кілька чоловіків і ошатно одягнених жінок.
                  Соковита темно-зелена гама з вкрапленнями коричневого і чорного нагадує
                  традиції художників барбізонської школи, але на відміну від їх згущується
                  сутінок і рухів "вологою" живописної атмосфери, що виникають із нюансів
                  тонального письма, полотно наповнене прозорим, чудовим у своїй буденності
                  та реальності повітрям.`
        },
        {
            id: 3,
            text:`Популярність Моне приніс портрет Камілли Донсьє (Жінка в зеленому),
                  намальований у 1866. Вона потім стала дружиною художника, і у них народився син Жан.`
        },
        {
            id: 4,
            text:`На ранніх етапах творчого шляху Моне зазнав впливу Е. Мане,
                  але потім зосередив всю увагу на передачі світла і відтінків кольору,
                  в чому був більш послідовний, ніж інші імпресіоністи.
                  З 1870 р. Моне майже повністю переключився на пейзажі та передачу
                  гармонії кольору при різному освітленні ("Бульвар капуцинів в Парижі", 1873 р.;
                  "Скелі Етрета", 1886 р.; "Макове поле", 1880-і рр.).
                  У 1890-х рр.. створив серії картин-варіацій на один сюжетний мотив ("Руанський собор").
                  Моне відтворював вібрацію світла і повітря за допомогою дрібних роздільних мазків
                  чистого кольору і додаткових тонів основного спектру, розраховуючи на
                  їх оптичне суміщення в процесі зорового сприйняття.
                  Домагаючись чистоти і звучності кольору, Клод Моне уникає змішувати фарби на палітрі;
                  щоб передати потрібний йому тон зеленого листя, художник кладе поруч мазки жовтого
                  і синього, на відстані вони зливаються, «змішуються» в оці глядача,
                  і листя здаються зеленими і немов тріпотливими на вітрі
                  («Стіг сіна», близько 1886).`
        },
        {
            id: 5,
            text:`У 1872-1873 рр. К. Моне створює одні з найкращих картин - "Бузок на сонці"
                 (1873), "Бульвар Капуцинок" (1873), "Поле маків у Аржантея" (1873),
                 "Враження . Схід сонця "(1872, Музей Мармоттан, Париж) та ін.
                 Дивлячись на ці картини, у глядача створюється враження особистої присутності
                 на цьому нескінченному святі життя, наповненому сонцем, світлом, гомоном натовпу.`
        },
        {
            id: 6,
            text:`Оселившись в Аржантеї, К. Моне з таким захопленням малює Сену, її мости,
                 вітрильники, що ковзають по водній поверхні. Він сам будує собі човен,
                 у якому спускається до самого Руана і там, вражений побаченим,
                 відтворює в своїх етюдах околиці міста і заходять в гирлі річки морські судна
                 ("Аржантей", 1872; "Вітрильний човен в Аржантеї", 1873-1874).`
        },
        {
            id: 7,
            text:`У 1877 р. К.Моне створює серію картин (на них представлений вокзал Сен-Лазар),
                 намітився новий етап у його творчості: відхід від цілісної концепції картини-етюду
                 у бік аналітичного підходу до зображуваного ("Вокзал Сен-Лазар", 1877, Музей Орсе, Париж).`
        },
        {
            id: 8,
            text:`Для робіт Моне пізнього періоду характерно наростання рис декоративізму.`
        },
        {
            id: 9,
            text:`Свої останні роботи - 14 великих декоративних панно «Німфеї» («Водяні лілії», або «Латаття»),
                 над якими Моне працював починаючи з 1918, - він заповів в дар державі:
                 пейзажі з мерехтливими водами, ліліями, сріблястими вербами і їх хиткими
                 відображеннями заповнюють простір двох овальних залів «Оранжереї» Лувру (Париж).`
        },
        {
            id: 10,
            text:`Моне вбирає в себе нові віяння і як би передбачає своєю творчістю роботи художників
                  кінця XIX - початку XX ст. Він по-іншому починає ставитися до кольору,
                  міняються сюжети його картин. Тепер основна увага художника зосереджена на
                  виразності колірної гами мазка у відриві від його предметної співвіднесеності,
                  посилюється прагнення до декоративності, яке вилилося в підсумку в створення картин-панно.`
        },
        {
            id: 11,
            text:`Прості сюжети картин 1860-1870 рр. поступаються місцем складним, багатим різними
                  асоціативними зв'язками: епічні зображення скель, елегійні шеренги тополь
                  ("Скелі в Бель-Іль", 1886; "Тополя", 1891).`
        },
        {
            id: 12,
            text:`На початку 1920-х у нього розвивається катаракта, через що йому довелося
                  перенести дві операції. Проте він не залишив занять малюванням.
                  Втративши кришталик на лівому оці, Моне знову знайшов зір, але став бачити
                  ультрафіолет як блакитний або ліловий колір, від чого його картини
                  знайшли нові кольори. Наприклад, малюючи знамениті «Водяні лілії»,
                  він бачив лілеї блакитнуватими в ультрафіолетовому діапазоні,
                  на відміну від звичайних людей, для яких вони були просто білими.`
        },
        {
            id: 13,
            text:`Моне продовжував працювати до останніх днів свого життя.
                  Художник помер в своєму будинку 5 грудня 1926 у Живерні і похований
                  на місцевому церковному цвинтарі. Його будинок та сади були відкриті
                  для відвідування в 1981р.`
        }
    ],
    periods: [
        {
            id: 0,
            title: "Рання творчість",
            notes: [
                {
                    id: 0,
                    text: `В юності художник жив в Гаврі, де, за порадою Будена, писав пейзажі
                           на відкритому повітрі.  У 1859 р., переїхавши до Парижа,
                           Моне подружився з Піссарро і  Ренуаром, які теж воліли писати
                           безпосередньо з натури.`
                },
                {
                    id: 1,
                    text: `Розвиваючи досягнення майстрів барбізонської школи, з 2-ї половини 1860-х р.
                           прагнув передати засобами пленерного живопису мінливість світлоповітряного середовища,
                           всю барвисту картину світу, зберігши свіжість першого зорового її сприйняття.`
                },
                {
                    id: 2,
                    text: `На ранніх етапах творчого шляху Моне зазнав впливу Е. Мане, але потім
                           зосередив всю увагу на передачі світла і відтінків кольору,
                           в чому був більш послідовний, ніж інші імпресіоністи.`
                }
            ],
            works: [
                {
                    id: 0,
                    title: "Жінка в зеленому",
                    year: 1866,
                    img: 'Camille.jpg',
                    likes: 3,
                    notes: [
                        {
                            id: 0,
                            text: `Моделлю для портрета послужила Камілла Донсьє, подруга і майбутня дружина Моне.
                                   Критик Теодор Торе стверджував, що картина була написана всього за декілька днів,
                                   що нагадує ранні роботи Курбе.`
                        },
                        {
                            id: 1,
                            text: `«Жінка в зеленій сукні» мала величезний успіх на Салоні в 1866.
                                   Своєю «Каміллою» Моне досяг повного успіху. Критика постійно хвалила той,
                                   що рівно струмує, як у старих майстрів, шовк сукні і порівнювала його
                                   з прославленими тканинами венеційського живописця Веронезе. «Поглянете на сукню.
                                   Вона гнучка і в той же час щільна, вона м'яко волочиться, вона живе,
                                   вона ясно говорить, хто ця жінка. Це не сукня ляльки, один з шматків мусліну,
                                   в якій обволікають мрію; це добротний шовк, який дійсно носять».
                                   Захоплювалися жвавістю фігури, тим, як вона, вирушаючи, обернулася.
                                   Скороминущість моменту, здається, схоплена тут і в позі, і в манері листа.`
                        }
                    ]
                },
                {
                    id: 1,
                    title: "Тераса в Сент-Адресс",
                    year: 1867,
                    img: 'Garden_at_Sainte_Adresse.jpg',
                    likes: 4,
                    notes: [
                        {
                            id: 0,
                            text: `«Тераса в Сент-Адресс» — картина Клода Моне, написана в 1867 році.
                                   Зберігається в музеї Метрополітен в Нью-Йорці.`
                        },
                        {
                            id: 1,
                            text: `Картина написана в період скрути Моне, коли він був змушений залишити Париж
                                   і повернутися в батьківський будинок в Сент-Адрессі, селі в Нормандії
                                   в гирлі Сени, за чотири кілометри від Гавру. У 1866-1868 роках художник
                                   подовгу жив тут у своєї тітки мадам Лекадр. У червні 1867 року в листі
                                   своєму другові Базилю художник писав, що почав близько 20 полотен:
                                   «кілька морських пейзажів, кілька фігур та видів саду. Крім того,
                                   в числі марин я пишу парусні гонки в Гаврі, з великою кількістю публіки
                                   на березі». У той же час Моне були написані картини: «Пляж в Сент-Адресс»,
                                   «Прогулянка по горбах в Сент-Адресс», «Регата в Сент-Адресс» та кілька інших.`
                        },
                        {
                            id: 2,
                            text: `Композиція картини оригінальна - верхній ракурс і відсутність центру.
                                   На передньому плані в кріслі праворуч сидить батько художника Адольф.
                                   Трохи лівіше, спиною до глядача, під парасолькою влаштувалася жінка:
                                   це тітка Моне, мадам Лекадр, або сестра Моне, Софі. Перед ними, в компанії молодої людини,
                                   стоїть кузина художника Жанна Маргарита. Широкий простір моря усіяний вітрильниками
                                   всіляких розмірів. Разом з смугою неба, розділеного на хмарну і безхмарну частини,
                                   половину композиції займає сама тераса, на якій бачимо масу яскравих гладіолусів і настурцій,
                                   причому розмаїття барв посилюється двома злегка асиметрично розставленими прапорами
                                   по обидві сторони тераси.`
                        },
                        {
                            id: 3,
                            text: `У цей період Моне ще прагнув до суворої побудови картини: вона чітко прописана,
                                   ретельно вивірена по композиції і мало нагадує м'які, розмиті тони робіт художника
                                   більш пізнього періоду. Пензель Моне тут не настільки вільний, як в паризьких роботах:
                                   фігури, тераса і море справляють враження дивної застиглості і схематизму.
                                   Картина проілюструвала його експерименти з безліччю мерехтливих та яскравих природних кольорів,
                                   цураючись похмурих коричневих і чорних кольорів, властивих більш раннім традиціям пейзажу.
                                   Вперше Моне написав кольорові тіні та передав квіти за допомогою вільно кинутих,
                                   світних плям чистої фарби.`
                        },
                        {
                            id: 4,
                            text: `Ця картина також свідчить про вплив на живопис Моне східного мистецтва, яке поширилося
                                   у Франції у другій половині століття у зв'язку з початком колекціонування японської графіки.
                                   Художник був пристрасним шанувальником японського мистецтва. У японських ксилографіях він
                                   відкрив композиційні ефекти, які досягаються гострим ракурсом і драматичним обрізом
                                   композиції рамою. На схилі років він говорив правнуку Мортьє: «У японських художників
                                   ми на Заході оцінили насамперед ту сміливість, з якою вони ріжуть рамкою свої сюжети.
                                   Ці люди навчили нас нової композиції». «Терасу в Сент-Адресс» художник називав своєю
                                   «китайською картиною з прапорами».`
                        }
                    ]
                },
                {
                    id: 2,
                    title: "Жінки в саду",
                    year: 1866,
                    img: 'Women_in_garden.jpg',
                    likes: 0,
                    notes: [
                        {
                            id: 0,
                            text: `«Жінки в саду» були намальовані Моне в передмісті Парижа під назвою Віль-Евре.
                                   Єдиною моделлю для цієї картини стала його дружина Камілла: вона-то і зобразила
                                   трьох з представлених на картині жінок, яких ми можемо бачити на картині.
                                   Метою написання цієї масштабної і ретельно продуманої картини було показати ефекти
                                   цього денного освітлення, а не звертати увагу на модель або драпіровку сукні.`
                        },
                        {
                            id: 1,
                            text: `За допомогою спалахів світла, які пронизують листя дерев, щоб пом'якшити тіні
                                   і зробити колір шкіри трохи теплішим, Моне робить акцент на природному освітленні пейзажу.
                                   У січні 1867 року його друг Базиль придбав роботу за 2,5 тисячі франків,
                                   щоб допомогти Моне вийти з великих боргів, які змусили його перекреслити близько
                                   двохсот його робіт, щоб вони не дісталися кредиторам.`
                        }
                    ]
                }
            ]
        },
        {
            id: 1,
            title: "Середній період (1870-1886)",
            notes: [
                {
                    id: 0,
                    text: `З 1870 р. Моне майже повністю переключився на пейзажі та передачу гармонії кольору при різному освітленні
                           ("Бульвар капуцинів в Парижі", 1873 р.; "Скелі Етрета", 1886 р.; "Макове поле", 1880-і рр.).
                           У 1890-х рр. створив серії картин-варіацій на один сюжетний мотив ("Руанський собор").
                           Моне відтворював вібрацію світла і повітря за допомогою дрібних роздільних мазків чистого кольору і
                           додаткових тонів основного спектру, розраховуючи на їх оптичне суміщення в процесі зорового сприйняття.
                           Домагаючись чистоти і звучності кольору, Клод Моне уникає змішувати фарби на палітрі;
                           щоб передати потрібний йому тон зеленого листя, художник кладе поруч мазки жовтого і синього,
                           на відстані вони зливаються, «змішуються» в оці глядача, і листя здаються зеленими і немов тріпотливими на вітрі
                           («Стіг сіна», близько 1886).`
                },
                {
                    id: 1,
                    text: `У 1872-1873 рр. К. Моне створює одні з найкращих картин - "Бузок на сонці" (1873, ГМИИ, Москва),
                          "Бульвар Капуцинок" (1873, ГМИИ, Москва), "Поле маків у Аржантея" (1873, Музей Орсе, Париж),
                          "Враження . Схід сонця "(1872, Музей Мармоттан, Париж) та ін .  Дивлячись на ці картини,
                          у глядача створюється враження особистої присутності на цьому нескінченному святі життя,
                          наповненому сонцем, світлом, гомоном натовпу.`
                },
                {
                    id: 2,
                    text: `Оселившись в Аржантеї, К. Моне з таким захопленням малює Сену, її мости, вітрильники, що ковзають
                           по водній поверхні. Він сам будує собі човен, у якому спускається до самого Руана і там,
                           вражений побаченим, відтворює в своїх етюдах околиці міста і заходять в гирлі річки морські судна
                           ("Аржантей", 1872, Національна галерея мистецтв, Вашингтон; "Вітрильний човен в Аржантеї",
                           1873-1874, Музей Орсе, Париж).`
                },
                {
                    id: 3,
                    text: `У 1877 р. К.Моне створює серію картин (на них представлений вокзал Сен-Лазар), намітився новий етап
                           у його творчості: відхід від цілісної концепції картини-етюду у бік аналітичного підходу до зображуваного
                           ("Вокзал Сен-Лазар", 1877, Музей Орсе, Париж).`
                }

            ],
            works: [
                {
                    id: 0,
                    title: "Жінка з парасолькою",
                    year: 1875,
                    img: 'Umbrella.jpg',
                    likes: 1,
                    notes: [
                        {
                            id: 0,
                            text: `Картина Клода Моне, створена у 1875 році. Відома також під назвою «Прогулянка» (La Promenade).
                                   Експонується у Національній галереї мистецтва (Вашингтон).`
                        },
                        {
                            id: 1,
                            text: `«Жінка з парасолькою» була написана на пленері, ймовірно за один сеанс в кілька годин.
                                   Картина була однією з 18 творів Моне, що були представлені на другій виставці імпресіоністів
                                   у квітні 1876 року в галереї Поля Дюран-Рюеля.`
                        },
                        {
                            id: 2,
                            text: `Моне продав картину лікарю Жоржу де Белліо в листопаді 1876 року. Після смерті де Белліо її успадкували
                                   його дочка Вікторина Доноп де Монші та зять Ернест Доноп де Монші. Потім картина була придбана Жоржем Меньє,
                                   а в 1965 році — Полом Меллоном, який подарував її Національній галереї мистецтва (Вашингтон),
                                   де вона й експонується зараз.`
                        },
                        {
                            id: 3,
                            text: `На картині зображено першу дружину Клода Моне Каміллу Донсьє з їхнім старшим сином Жаном
                                   під час прогулянки вітряним літнім днем поблизу Аржантея, де з 1871 по 1878 рр. мешкала родина художника.`
                        }

                    ]
                },
                {
                    id: 1,
                    title: "Враження. Схід сонця",
                    year: 1872,
                    img: 'Impression_soleil_levant.jpg',
                    likes: 4,
                    notes: [
                        {
                            id: 0,
                            text: `«Враження. Схід сонця» — картина Клода Моне, створена у 1872 році, яка дала назву художній течії –
                                   імпресіонізму. Експонувалася у квітні 1874 року на першій виставці «Анонімної кооперативної спілки художників,
                                   скульпторів і граверів», яка стане пізніше відомою як «виставка імпресіоністів».`
                        },
                        {
                            id: 1,
                            text: `У роботі «Враження. Схід сонця» Моне не намагається відтворити дійсність, наслідувати природу,
                                   а прагне передати своє власне враження від неї. З точки зору академічного живопису картина груба і неохайна,
                                   фігури ледь намічені. Моне демонструє колористичний взаємозв’язок синьої води та сходу, яскраві рефлекси
                                   на вранішнім морі.`
                        },
                        {
                            id: 2,
                            text: `Назва «Враження. Схід сонця» з’явилася в останній момент перед виставкою, коли журналіст Едмон Ренуар,
                                   брат П'єра-Огюста Ренуара, який складав каталог виставки, попросив придумати більш оригінальну назву,
                                   ніж, наприклад, «Вид на гавань Гавра».`
                        },
                        {
                            id: 3,
                            text: `Після виставки картину купує за 800 франків підприємець Ернест Ошад. Після банкрутства Ошада у 1878 році
                                   його колекцію розпродають з аукціону. За 210 франків «Враження» купує лікар Жорж Белліо.
                                   У 1957 році дочка Белліо Вікторина Доноп де Монші подарувала колекцію, яку успадкувала від свого батька,
                                   музею Мармоттан.`
                        },
                        {
                            id: 4,
                            text: `Картина була викрадена з музею разом з чотирма іншими полотнами Моне і двома Ренуара, але була знайдена у 1990 році.
                                   З 1991 року картина повернена в експозицію музею.`
                        }
                    ]
                },
                {
                    id: 2,
                    title: "Поле маків у Аржантея",
                    year: 1873,
                    img: 'Poppies.jpg',
                    likes: 13,
                    notes: [
                        {
                            id: 0,
                            text: `Повернувшись з Англії, Моне зупинився в Аржантеї і жив там до 1878 року, що стало для нього часом вдосконалення.
                                   В довколишній місцевості Моне знайшов яскраві пейзажі, які дозволили йому дослідити потенціал пленерного живопису.
                                   На цій картині художник зобразив яскраве макове поле в сільській місцевості, яке ворушить легкий вітерець.
                                   На передній план пейзажу вписані мати і дитина, ймовірно, дружина Моне, Камілла, і їх син Жан.`
                        },
                        {
                            id: 1,
                            text: `Картина візуально ділиться на дві частини за допомогою діагоналі: одна наповнена яскравими плямами маків,
                                   а інша виглядає порожнім, наче художник зовсім забув приділити їй увагу. Саме червоний колір задає структуру картини.
                                   Цікаво, що якщо її перевести в чорно-білий колір, більшість маків на ній вже не буде видно.`
                        }
                    ]
                },
                {
                    id: 3,
                    title: "Бульвар Капуцинок",
                    year: 1873,
                    img: 'Boulevard_capucines.jpg',
                    likes: 7,
                    notes: [
                        {
                            id: 0,
                            text: `«Бульвар Капуцинок» зображує сцену метушні паризького життя, яку Моне міг бачити зі студії свого друга,
                                   фотографа Фелікса Надара. Художник використовує тут короткі, швидкі мазки, щоб «оживити» людей, передати їх у русі.
                                   Найімовірніше, на картині зображений ранковий або денний бульвар, в період ранньої весни,
                                   коли на дорогах ще лежить сніг.`
                        },
                        {
                            id: 1,
                            text: `«Бульвар Капуцинок» зображує сцену метушні паризького життя, яку Моне міг бачити зі студії свого друга,
                                   фотографа Фелікса Надара. Художник використовує тут короткі, швидкі мазки, щоб «оживити» людей, передати їх у русі.
                                   Найімовірніше, на картині зображений ранковий або денний бульвар, в період ранньої весни,
                                   коли на дорогах ще лежить сніг.`
                        }
                    ]
                }
            ]
        },
        {
            id: 2,
            title: "Пізній період (1886-1926)",
            notes: [
                {
                    id: 0,
                    text: `Для робіт Моне пізнього періоду характерно наростання рис декоративізму.`
                },
                {
                    id: 1,
                    text: `Свої останні роботи - 14 великих декоративних панно «Німфеї» («Водяні лілії», або «Латаття»),
                           над якими Моне працював починаючи з 1918, - він заповів в дар державі: пейзажі з мерехтливими водами,
                           ліліями, сріблястими вербами і їх хиткими відображеннями заповнюють простір двох овальних залів «Оранжереї»
                           Лувру (Париж).`
                },
                {
                    id: 2,
                    text: `Моне вбирає в себе нові віяння і як би передбачає своєю творчістю роботи художників кінця XIX - початку XX ст.
                           Він по-іншому починає ставитися до кольору, міняються сюжети його картин. Тепер основна увага художника
                           зосереджена на виразності колірної гами мазка у відриві від його предметної співвіднесеності,
                           посилюється прагнення до декоративності, яке вилилося в підсумку в створення картин-панно.`
                },
                {
                    id: 3,
                    text: `Прості сюжети картин попереніх періодів творчості поступаються місцем складним,
                           багатим різними асоціативними зв'язками: епічні зображення скель, елегійні шеренги тополь
                           ("Скелі в Бель-Іль", 1886; "Тополя", 1891).`
                }

            ],
            works: [
                {
                    id: 0,
                    title: "Водяні лілії",
                    year: 1906,
                    img: 'Water_Lilies.jpg',
                    likes: 24,
                    notes: [
                        {
                            id: 0,
                            text: `«Водяні лілії» — цикл з приблизно 250 картин французького художника-імпресіоніста Клода Моне (1840-1926),
                                   виконаних у техніці олійного живопису. Картини, що зображують квітник садиби Моне в Живерні,
                                   становили головний предмет творчих зусиль художника в останні тридцять років його життя.
                                   Багато з робіт були створені, коли Моне вже страждав від катаракти.`
                        },
                        {
                            id: 1,
                            text: `Схильність Моне до створення серій картин, об'єднаних загальною темою і перспективою,
                                   стала проявлятися з 1889 року, коли він закінчив не менше 10 картин із циклу «Долина Крез»,
                                   пізніше виставлених у галереї Жоржа Петі. Іншим відомим циклом картин Моне є «Копиці».`
                        },
                        {
                            id: 2,
                            text: `В 1920-ті в музеї Оранжері за державний рахунок були побудовані дві овальні зали для постійного
                                   зберігання восьми фресок Моне з водяними ліліями. Виставка відкрилася для публіки 16 травня 1927,
                                   через кілька місяців після смерті Моне. [1] У 1999 році в музеї Оранжері відбулася спеціальна виставка
                                   «Водної лілій» Моне, для якої з усього світу було зібрано 60 картин. Дана робота виконана в 1906 році.`
                        },
                        {
                            id: 3,
                            text: `За словами Джованні Бертаццоні, голови департаменту мистецтва імпресіоністів і модерністів аукціонного дому «Крістіс»:
                                   «Водяні лілії» Моне входять до числа найбільш знаменитих та визнаних робіт XX століття, надавши колосальний вплив
                                   на цілі покоління художників».`
                        }

                    ]
                },
                {
                    id: 1,
                    title: "Руанський собор: головний вхід на сонці",
                    year: 1894,
                    img: 'Rouen_Cathedral.jpg',
                    likes: 0,
                    notes: [
                        {
                            id: 0,
                            text: `Ця робота - одна з цілої серії картин на тему Руанського собору. Клод Моне писав фасад собору в різний час доби,
                                   щоб вивчити різні світлові ефекти в зимовий період. На полотнах, в основному, домінують яскравий помаранчевий
                                   і блакитний кольори собору, і лише нагорі картини видніється невеликий синій ділянку неба.
                                   Художник з допомогою напівпрозорих мазків грає зі світлом і текстурою кам'яної поверхні собору.`
                        },
                        {
                            id: 1,
                            text: `Щоб робота просувалася швидше, Моне спеціально оселився прямо навпроти свого головного об'єкта для живопису.
                                   У 1895 році він представив дванадцять «Соборів» на виставці в галереї Дюран-Рюеля, де вони були розкритиковані,
                                   і обдаровані похвалами тих глядачів, які ратували за художні інновації Моне.`
                        }
                    ]
                },
                {
                    id: 2,
                    title: "Копиці сіна",
                    year: 1891,
                    img: 'haystack.webp',
                    likes: 107,
                    notes: [
                        {
                            id: 0,
                            text: `Фермерське поле зі стогами розташовувалося відразу за садом Клода Моне в Живерні. Насправді зображені конструкції -
                                   це не складене сіно, а зерносховища, накриті конічними дахами. Ці солом'яні дахи захищали зерно від вологи і гризунів
                                   до самої весни.`
                        },
                        {
                            id: 1,
                            text: `У 1890 році Моне 50 років - і він кожен день протягом півроку (з серпня по січень) йде в поле на захід від свого саду,
                                   щоб зробити одну з найважливіших мальовничих революцій. Копиці - це перша створена Моне серія з величезної кількості
                                   полотен, початок тієї особливої ??живописної форми, в якій художник буде працювати потім в Лондоні, в Руані.
                                   «Коли я починав, все було як завжди. Я думав, що досить два полотна - один для похмурого дня і один для сонячного»,
                                   - розповідав пізніше Моне. Коли світло змінився, він взяв ще одне полотно, потім ще одне.
                                   До кінця січня завершених картин було 25.`
                        },
                        {
                            id: 2,
                            text: `Письменник Октав Мірбо: "Один Моне, побачив у цій серії грандіозний ефект, що виходить далеко за межі фермерського
                                   поля в Живерні. Це різні стани свідомості планети. Це драма землі».`
                        },
                        {
                            id: 3,
                            text: `Сьогодні, щоб побачити якомога більше станів свідомості планети, потрібно їхати в Америку, Чикаго і Бостон.
                                   Практично вся серія Моне була розкуплена американцями.`
                        }
                    ]
                }
            ]
        },                
    ]
};

const Store = ({ children }) => {
    const [painter, setPainter] = useState(infoOfPainter);

    const store = {
        painter: [painter, setPainter]
    };

    return (
        <StoreContext.Provider value={store}>{children}</StoreContext.Provider>
    );
}

export default Store;