import React from 'react';
import './hw1.css';

const Hw1 = () => {
  return (
      <div className="hw1">
        <h1 className="head">Моє місто - <strong>Черкаси</strong></h1>
        <div className="flag">
            <img src="./hw1/flag.svg" alt="flag"/>
            <div>прапор міста</div>
        </div>
        <div className="gerb">
            <img src="./hw1/gerb.png" alt="gerb"/>
            <div>герб міста</div>          
        </div>        
        <div className="view">
            <img src="./hw1/view.jpg" alt="view"/>
            <div>Панорама Черкас</div>          
        </div> 
        <div className="main">
            <p>
            <strong>Черка́си</strong> — місто, обласний та районний центр в Україні,
            промисловий центр Центрального економічного району,
            значний культурний та освітній осередок.
            </p>
            <p>Місто відоме з XIII століття і за час свого існування відіграло
            певну роль в історії всієї України.
            Черкаси були осередком формування Козаччини,
            мешканці міста брали безпосередню участь в Хмельниччині та Коліївщині.
            Зростання міста, після отримання статусу обласного центру,
            призвело до перетворення його у великий промисловий центр і
            головний культурний осередок цілого регіону.
            </p>
            <p>Черкаси розташовані на правому березі Кременчуцького водосховища,
            створеного у середній течії Дніпра.
            Адміністративно місто поділяється на 2 міських райони —
            Придніпровський та Соснівський, до останнього також належить селище Оршанець.
            Населення міста — 276 360 осіб (2019).
            </p>
            <h3>Походження назви</h3>
            <p>Походження топоніму «Черкаси» та його істинна етимологія лишається
            нерозв'язаною і дотепер загадкою. Назва міста напряму пов'язана з
            екзоетнонімом черкаси — так називали всіх українців сусідні народи,
            зокрема росіяни та кримські татари, про що вперше повідомив 1245 року
            італійський посол Джованні Да Плано Карпіні.
            </p>
            <h3>Розташування</h3>
            <p>Черкаси розташовані на високому правому березі головної річкової артерії України —
            Дніпра, зокрема, створеного в його середній течії Кременчуцького водосховища,
            через яке збудовано чи не найбільший міст-дамбу в Україні.
            Рельєф історичної частини міста сформували Замкова гора,
            на якій розташовувався Черкаський замок, та численні яри в Соснівці.
            Але більша частина міста розташована на рівнині.
            Інтенсивна урбанізація спотворила історичний природний ландшафт
            дніпровських пагорбів у Черкасах.
            </p>                        
        </div>
      </div>
  );
}

export default Hw1;